morfredus/ESP32-Diagnostic/src/main.cpp
// RGB LED pins (modifiable via web interface)
int rgb_led_pin_r = LED_RED;
int rgb_led_pin_g = LED_GREEN;
int rgb_led_pin_b = LED_BLUE;

// Sensor and output pins (modifiable via web interface)
int pwm_pin = PWM;
int buzzer_pin = BUZZER;
int dht_pin = DHT;
int light_sensor_pin = LIGHT_SENSOR;
int distance_trig_pin = DISTANCE_TRIG;
int distance_echo_pin = DISTANCE_ECHO;
int motion_sensor_pin = MOTION_SENSOR;

// SD Card pins (modifiable via web interface)
int sd_miso_pin = SD_MISO;
int sd_mosi_pin = SD_MOSI;
int sd_sclk_pin = SD_SCLK;
int sd_cs_pin = SD_CS;

// Rotary Encoder pins (modifiable via web interface)
int rotary_clk_pin = ROTARY_CLK;
int rotary_dt_pin = ROTARY_DT;
int rotary_sw_pin = ROTARY_SW;

// OLED display settings (from config.h)
uint8_t oledRotation = DEFAULT_OLED_ROTATION;
int oledWidth = SCREEN_WIDTH;
int oledHeight = SCREEN_HEIGHT;

// DHT sensor type (configurable at runtime)
uint8_t DHT_SENSOR_TYPE = DEFAULT_DHT_SENSOR_TYPE;

// ========== OBJETS GLOBAUX ==========
WebServer server(WEB_SERVER_PORT);
WiFiMulti wifiMulti;
#if DIAGNOSTIC_HAS_MDNS
bool mdnsServiceActive = false;
bool wifiPreviouslyConnected = false;
unsigned long lastMDNSAttempt = 0;
bool mdnsLastAttemptFailed = false;
#if defined(DIAGNOSTIC_USES_IDF_MDNS)
bool mdnsResponderInitialized = false;
#endif
#endif
U8G2_SSD1306_128X64_NONAME_F_HW_I2C oled(U8G2_R0, U8X8_PIN_NONE);


// NeoPixel (from board_config.h via config.h)
int LED_PIN = NEOPIXEL;
int LED_COUNT = DEFAULT_NEOPIXEL_COUNT;

// TFT pins (modifiables via web)
#if ENABLE_TFT_DISPLAY
int tftMISO = TFT_MISO;
int tftMOSI = TFT_MOSI;
int tftSCLK = TFT_SCLK;
int tftCS = TFT_CS;
int tftDC = TFT_DC;
int tftRST = TFT_RST;
int tftBL = TFT_BL;
int tftWidth = TFT_WIDTH;
int tftHeight = TFT_HEIGHT;
int tftRotation = TFT_ROTATION;
#endif
Adafruit_NeoPixel *strip = nullptr;

// NeoPixel heartbeat state
volatile bool neopixelStatusPaused = false;
unsigned long neopixelHeartbeatPreviousMillis = 0;
const unsigned long NEOPIXEL_HEARTBEAT_INTERVAL_MS = 1000;
bool neopixelHeartbeatState = false;
bool neopixelStatusKnown = false;
bool neopixelLastWifiConnected = false;
bool neopixelConnecting = false;

// [OPT-004] Constant for repeated test result initialization
static const String DEFAULT_TEST_RESULT_STR = String(Texts::not_tested);
// [OPT-009] Constants for repeated test status strings
static const String OK_STR = String(Texts::ok);
static const String FAIL_STR = String(Texts::fail);

bool neopixelTested = false;
bool neopixelAvailable = false;
bool neopixelSupported = false;
String neopixelTestResult = DEFAULT_TEST_RESULT_STR;

// Forward declarations for NeoPixel functions
void neopixelShowRebootFlash();
void neopixelSetWifiState(bool connected);
void neopixelShowConnecting();
void neopixelPauseStatus();
void neopixelResumeStatus();
void neopixelRestoreWifiStatus();
void updateNeoPixelWifiStatus();

// Built-in LED (from config.h)
int BUILTIN_LED_PIN = LED_BUILTIN;
bool builtinLedTested = false;
bool builtinLedAvailable = false;
String builtinLedTestResult = DEFAULT_TEST_RESULT_STR;

bool oledTested = false;
bool oledAvailable = false;
String oledTestResult = DEFAULT_TEST_RESULT_STR;

#if ENABLE_TFT_DISPLAY
String tftTestResult = DEFAULT_TEST_RESULT_STR;
#endif

// Exécution asynchrone des tests matériels
typedef void (*TestRoutine)();

struct AsyncTestRunner {
  const char* taskName;
  TaskHandle_t taskHandle;
  volatile bool running;
};

struct AsyncTestTaskArgs {
  AsyncTestRunner* runner;
  TestRoutine routine;
};

static void asyncTestTask(void* parameters) {
  AsyncTestTaskArgs* args = static_cast<AsyncTestTaskArgs*>(parameters);
  if (args && args->routine) {
    args->routine();
  }
  if (args) {
    if (args->runner) {
      args->runner->running = false;
      args->runner->taskHandle = nullptr;
    }
    delete args;
  }
  vTaskDelete(nullptr);
}

static bool startAsyncTest(AsyncTestRunner& runner,
                           TestRoutine routine,
                           bool& alreadyRunning,
                           uint32_t stackSize = 4096,
                           UBaseType_t priority = 1) {
  alreadyRunning = runner.running;
  if (runner.running) {
    return false;
  }

  AsyncTestTaskArgs* args = new AsyncTestTaskArgs{&runner, routine};
  runner.running = true;

#if CONFIG_FREERTOS_UNICORE
  const BaseType_t targetCore = tskNO_AFFINITY;
#else
  const BaseType_t targetCore = 1;
#endif

  BaseType_t result = xTaskCreatePinnedToCore(asyncTestTask,
                                              runner.taskName,
                                              stackSize,
                                              args,
                                              priority,
                                              &runner.taskHandle,
                                              targetCore);
  if (result != pdPASS) {
    runner.running = false;
    runner.taskHandle = nullptr;
    delete args;
    alreadyRunning = false;
    return false;
  }

  alreadyRunning = false;
  return true;
}

// Orchestrateurs asynchrones des tests lents
static AsyncTestRunner builtinLedTestRunner = {"BuiltinLEDTest", nullptr, false};
static AsyncTestRunner neopixelTestRunner = {"NeoPixelTest", nullptr, false};
static AsyncTestRunner oledTestRunner = {"OLEDTest", nullptr, false};
static AsyncTestRunner rgbLedTestRunner = {"RgbLedTest", nullptr, false};
static AsyncTestRunner buzzerTestRunner = {"BuzzerTest", nullptr, false};
static AsyncTestRunner sdTestRunner = {"SDTest", nullptr, false};
static AsyncTestRunner rotaryTestRunner = {"RotaryTest", nullptr, false};

bool runtimeBLE = false;

String adcTestResult = DEFAULT_TEST_RESULT_STR;
String pwmTestResult = DEFAULT_TEST_RESULT_STR;
String partitionsInfo;
String spiInfo;
String stressTestResult = DEFAULT_TEST_RESULT_STR;
// Memory stress telemetry cache
size_t stressAllocationCount = 0;
unsigned long stressDurationMs = 0;

// Résultats de tests des nouveaux capteurs
String rgbLedTestResult = DEFAULT_TEST_RESULT_STR;
bool rgbLedAvailable = false;

String buzzerTestResult = DEFAULT_TEST_RESULT_STR;
bool buzzerAvailable = false;

String dhtTestResult = DEFAULT_TEST_RESULT_STR;
bool dhtAvailable = false;
float dhtTemperature = -999.0;
float dhtHumidity = -999.0;

String lightSensorTestResult = DEFAULT_TEST_RESULT_STR;
bool lightSensorAvailable = false;
int lightSensorValue = -1;

