morfredus/ESP32-Diagnostic/src/main.cpp
  #ifdef CONFIG_IDF_TARGET_ESP32
    int gpios[] = {0,2,4,5,12,13,14,15,16,17,18,19,21,22,23,25,26,27,32,33};
    int numGPIO = 20;
  #elif defined(CONFIG_IDF_TARGET_ESP32S3)
    int gpios[] = {0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21};
    int numGPIO = 22;
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    int gpios[] = {0,1,2,3,4,5,6,7,8,9,10};
    int numGPIO = 11;
  #else
    int gpios[] = {0,2,4,5};
    int numGPIO = 4;
  #endif
  
  for (int i = 0; i < numGPIO; i++) {
    GPIOTestResult result;
    result.pin = gpios[i];
    result.tested = true;
    result.working = testSingleGPIO(gpios[i]);
    result.mode = "Digital I/O";
    // [OPT-009]: Use pre-allocated constants instead of String(Texts::ok/fail)
    result.notes = result.working ? OK_STR : FAIL_STR;
    gpioResults.push_back(result);
  }
  Serial.printf("GPIO: %d testes\r\n", numGPIO);
}

// ========== LED INTÉGRÉE ==========
void detectBuiltinLED() {
  String chipModel = detectChipModel();
  
  #ifdef LED_BUILTIN
    BUILTIN_LED_PIN = LED_BUILTIN;
  #else
    if (chipModel == "ESP32-S3") BUILTIN_LED_PIN = 2;
    else if (chipModel == "ESP32-C3") BUILTIN_LED_PIN = 8;
    else if (chipModel == "ESP32-S2") BUILTIN_LED_PIN = 15;
    else BUILTIN_LED_PIN = 2;
  #endif
  
  // [OPT-008]: Buffer-based test result initialization (1 vs 4 allocations)
  char ledBuf[96];
  snprintf(ledBuf, sizeof(ledBuf), "%s %d - %s", Texts::gpio.str().c_str(), BUILTIN_LED_PIN, Texts::not_tested.str().c_str());
  builtinLedTestResult = String(ledBuf);
  Serial.printf("LED integree: GPIO %d\r\n", BUILTIN_LED_PIN);
}

void testBuiltinLED() {
  if (BUILTIN_LED_PIN == -1) return;
  
  Serial.println("\r\n=== TEST LED ===");
  pinMode(BUILTIN_LED_PIN, OUTPUT);

  for (int i = 0; i < 5; i++) {
    digitalWrite(BUILTIN_LED_PIN, HIGH);
    delay(80);
    digitalWrite(BUILTIN_LED_PIN, LOW);
    delay(80);
  }

  for (int i = 0; i <= 255; i += 51) {
    analogWrite(BUILTIN_LED_PIN, i);
    delay(25);
    yield();
  }
  for (int i = 255; i >= 0; i -= 51) {
    analogWrite(BUILTIN_LED_PIN, i);
    delay(25);
    yield();
  }
  
  digitalWrite(BUILTIN_LED_PIN, LOW);
  builtinLedAvailable = true;
  // [OPT-009]: Buffer-based test result (1 vs 4 allocations)
  char ledBuf[96];
  snprintf(ledBuf, sizeof(ledBuf), "%s %s - GPIO %d", Texts::test.str().c_str(), Texts::ok.str().c_str(), BUILTIN_LED_PIN);
  builtinLedTestResult = String(ledBuf);
  builtinLedTested = true;
  Serial.println("LED: OK");
}

void resetBuiltinLEDTest() {
  builtinLedTested = false;
  builtinLedAvailable = false;
  if (BUILTIN_LED_PIN != -1) digitalWrite(BUILTIN_LED_PIN, LOW);
}

// ========== NEOPIXEL ==========
void detectNeoPixelSupport() {
  String chipModel = detectChipModel();
  
  if (CUSTOM_LED_PIN != -1) {
    LED_PIN = CUSTOM_LED_PIN;
    neopixelSupported = true;
  }
  else if (chipModel == "ESP32-S3") {
    LED_PIN = 48;
    neopixelSupported = true;
  } 
  else if (chipModel == "ESP32-C3") {
    LED_PIN = 8;
    neopixelSupported = true;
  }
  else {
    LED_PIN = 2;
    neopixelSupported = false;
  }
  
  if (strip != nullptr) delete strip;
  strip = new Adafruit_NeoPixel(LED_COUNT, LED_PIN, NEO_GRB + NEO_KHZ800);
  // [OPT-008]: Buffer-based test result initialization (1 vs 4 allocations)
  char neoBuf[96];
  snprintf(neoBuf, sizeof(neoBuf), "%s %d - %s", Texts::gpio.str().c_str(), LED_PIN, Texts::not_tested.str().c_str());
  neopixelTestResult = String(neoBuf);
  Serial.printf("NeoPixel: GPIO %d\r\n", LED_PIN);
}

void testNeoPixel() {
  if (!strip) return;

  Serial.println("\r\n=== TEST NEOPIXEL ===");
  strip->begin();
  strip->clear();
  strip->show();

  strip->setPixelColor(0, strip->Color(255, 0, 0));
  strip->show();
  delay(160);

  strip->setPixelColor(0, strip->Color(0, 255, 0));
  strip->show();
  delay(160);

  strip->setPixelColor(0, strip->Color(0, 0, 255));
  strip->show();
  delay(160);

  for (int i = 0; i < 256; i += 64) {
    strip->setPixelColor(0, strip->gamma32(strip->ColorHSV(i * 256)));
    strip->show();
    delay(28);
    yield();
  }

  strip->clear();
  strip->show();

  neopixelAvailable = true;
  // [OPT-009]: Buffer-based test result (1 vs 4 allocations)
  char neoBuf[96];
  snprintf(neoBuf, sizeof(neoBuf), "%s %s - GPIO %d", Texts::test.str().c_str(), Texts::ok.str().c_str(), LED_PIN);
  neopixelTestResult = String(neoBuf);
  neopixelTested = true;
  Serial.println("NeoPixel: OK");
}

void resetNeoPixelTest() {
  neopixelTested = false;
  neopixelAvailable = false;
  if (strip) {
    strip->clear();
    strip->show();
  }
}

static inline bool neopixelReady() {
  return strip != nullptr;
}

void neopixelPauseStatus() {
  neopixelStatusPaused = true;
}

void neopixelResumeStatus() {
  neopixelStatusPaused = false;
  neopixelStatusKnown = false;
  neopixelConnecting = false;
}

void neopixelShowConnecting() {
  if (!neopixelReady() || neopixelStatusPaused) return;
  neopixelConnecting = true;
  strip->setBrightness(60);
  strip->setPixelColor(0, strip->Color(50, 50, 0)); // Jaune fixe pendant la connexion
  strip->show();
}

void neopixelSetWifiState(bool connected) {
  if (!neopixelReady() || neopixelStatusPaused) return;
  neopixelConnecting = false;
  neopixelLastWifiConnected = connected;
  neopixelStatusKnown = true;
  neopixelHeartbeatPreviousMillis = millis();
  neopixelHeartbeatState = false;
  strip->setBrightness(60);
  strip->setPixelColor(0, connected ? strip->Color(0, 50, 0) : strip->Color(50, 0, 0));
  strip->show();
}

void updateNeoPixelWifiStatus() {
  if (!neopixelReady() || neopixelStatusPaused) return;
  if (neopixelConnecting) return; // Couleur fixe tant que la connexion est en cours

  bool connected = (WiFi.status() == WL_CONNECTED);

  if (!neopixelStatusKnown || connected != neopixelLastWifiConnected) {
    neopixelSetWifiState(connected);
    return;
  }

  unsigned long now = millis();
  if (now - neopixelHeartbeatPreviousMillis >= NEOPIXEL_HEARTBEAT_INTERVAL_MS) {
    neopixelHeartbeatPreviousMillis = now;
    neopixelHeartbeatState = !neopixelHeartbeatState;
    uint32_t color = connected
      ? (neopixelHeartbeatState ? strip->Color(0, 50, 0) : strip->Color(0, 10, 0))
      : (neopixelHeartbeatState ? strip->Color(50, 0, 0) : strip->Color(10, 0, 0));
    strip->setPixelColor(0, color);
    strip->show();
  }
}

void neopixelRestoreWifiStatus() {
  neopixelResumeStatus();
  updateNeoPixelWifiStatus();
}

