morfredus/ESP32-Diagnostic/src/main.cpp
  return true;
}

String getOLEDStepLabel(const String &stepId) {
  if (stepId == "welcome") return String(Texts::oled_step_welcome);
  if (stepId == "big_text") return String(Texts::oled_step_big_text);
  if (stepId == "text_sizes") return String(Texts::oled_step_text_sizes);
  if (stepId == "shapes") return String(Texts::oled_step_shapes);
  if (stepId == "horizontal_lines") return String(Texts::oled_step_horizontal_lines);
  if (stepId == "diagonals") return String(Texts::oled_step_diagonals);
  if (stepId == "moving_square") return String(Texts::oled_step_moving_square);
  if (stepId == "progress_bar") return String(Texts::oled_step_progress_bar);
  if (stepId == "scroll_text") return String(Texts::oled_step_scroll_text);
  if (stepId == "final_message") return String(Texts::oled_step_final_message);
  return stepId;
}

void testOLED() {
  if (!oledAvailable || oledTested) return;

  Serial.println("\r\n=== TEST OLED ===");

  oledStepWelcome();
  oledStepBigText();
  oledStepTextSizes();
  oledStepShapes();
  oledStepHorizontalLines();
  oledStepDiagonals();
  oledStepMovingSquare();
  oledStepProgressBar();
  oledStepScrollText();
  oledStepFinalMessage();

  oledTested = true;
  // [OPT-009]: Buffer-based test result (1 vs 3 allocations)
  char oledBuf[96];
  snprintf(oledBuf, sizeof(oledBuf), "%s %s - 128x64", Texts::test.str().c_str(), Texts::ok.str().c_str());
  oledTestResult = String(oledBuf);
  Serial.println("OLED: Tests complets OK\r\n");
}

void resetOLEDTest() {
  oledTested = false;
  if (oledAvailable) {
    oled.clearBuffer();
    oled.sendBuffer();
  }
}

void oledShowMessage(String message) {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  oled.setFont(u8g2_font_6x10_tf);
  oled.drawStr(0, 10, message.c_str());
  oled.sendBuffer();
}

// WiFi connection status banner on OLED
void oledShowWiFiStatus(const String& title,
                        const String& detail,
                        const String& footer,
                        int progressPercent) {
  if (!oledAvailable) {
    return;
  }

  int clampedProgress = progressPercent;
  if (clampedProgress < 0) {
    clampedProgress = -1;
  } else if (clampedProgress > 100) {
    clampedProgress = 100;
  }

  applyOLEDOrientation();
  oled.clearBuffer();
  oled.setFont(u8g2_font_6x10_tf);
  oled.drawStr(0, 12, title.c_str());

  if (detail.length() > 0) {
    oled.drawStr(0, 28, detail.c_str());
  }

  if (footer.length() > 0) {
    oled.drawStr(0, 44, footer.c_str());
  }

  if (clampedProgress >= 0) {
    const int barX = 8;
    const int barY = 52;
    const int barWidth = SCREEN_WIDTH - (barX * 2);
    const int barHeight = 10;
    oled.drawFrame(barX, barY, barWidth, barHeight);
    int fillWidth = (barWidth - 2) * clampedProgress / 100;
    if (fillWidth > 0) {
      oled.drawBox(barX + 1, barY + 1, fillWidth, barHeight - 2);
    }
  }

  oled.sendBuffer();
}

// ========== TEST TFT ==========
// Individual TFT test steps
void tftStepBoot() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  displayBootSplash();
  delay(1000);
#endif
}

void tftStepColors() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  
  uint16_t colors[] = {TFT_RED, TFT_GREEN, TFT_BLUE, TFT_YELLOW, TFT_CYAN, TFT_MAGENTA, TFT_WHITE};
  const char* names[] = {"RED", "GREEN", "BLUE", "YELLOW", "CYAN", "MAGENTA", "WHITE"};
  
  for (int i = 0; i < 7; i++) {
    tft.fillScreen(colors[i]);
    tft.setTextColor(TFT_BLACK);
    tft.setTextSize(2);
    tft.setCursor(60, 110);
    tft.print(names[i]);
    delay(500);
  }
#endif
}

void tftStepShapes() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  
  tft.fillScreen(TFT_BLACK);
  
  // Rectangles
  tft.drawRect(20, 20, 80, 60, TFT_RED);
  tft.fillRect(140, 20, 80, 60, TFT_GREEN);
  
  // Circles
  tft.drawCircle(60, 140, 30, TFT_BLUE);
  tft.fillCircle(180, 140, 30, TFT_YELLOW);
  
  // Triangles
  tft.drawTriangle(60, 180, 40, 220, 80, 220, TFT_CYAN);
  tft.fillTriangle(180, 180, 160, 220, 200, 220, TFT_MAGENTA);
  
  delay(1500);
#endif
}

void tftStepText() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  
  tft.fillScreen(TFT_BLACK);
  
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(1);
  tft.setCursor(10, 10);
  tft.println("Text Size 1");
  
  tft.setTextSize(2);
  tft.setCursor(10, 40);
  tft.println("Size 2");
  
  tft.setTextSize(3);
  tft.setCursor(10, 80);
  tft.println("Size 3");
  
  tft.setTextColor(TFT_CYAN);
  tft.setTextSize(2);
  tft.setCursor(10, 140);
  tft.println("Colored Text");
  
  delay(1500);
#endif
}

void tftStepLines() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  
  tft.fillScreen(TFT_BLACK);
  
  // Horizontal lines
  for (int y = 0; y < TFT_HEIGHT; y += 10) {
    tft.drawFastHLine(0, y, TFT_WIDTH, TFT_CYAN);
  }
  delay(700);
  
  tft.fillScreen(TFT_BLACK);
  
  // Vertical lines
  for (int x = 0; x < TFT_WIDTH; x += 10) {
    tft.drawFastVLine(x, 0, TFT_HEIGHT, TFT_MAGENTA);
  }
  delay(700);
  
  tft.fillScreen(TFT_BLACK);
  
  // Diagonal lines
  for (int i = 0; i < TFT_WIDTH; i += 20) {
    tft.drawLine(0, 0, i, TFT_HEIGHT - 1, TFT_YELLOW);
    tft.drawLine(TFT_WIDTH - 1, 0, i, TFT_HEIGHT - 1, TFT_GREEN);
  }
  delay(700);
#endif
}

void tftStepAnimation() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  
  tft.fillScreen(TFT_BLACK);
  
  // Moving square
  int squareSize = 30;
  for (int x = 0; x <= TFT_WIDTH - squareSize; x += 5) {
    tft.fillRect(x, (TFT_HEIGHT - squareSize) / 2, squareSize, squareSize, TFT_BLUE);
    delay(20);
    if (x + squareSize < TFT_WIDTH) {
      tft.fillRect(x, (TFT_HEIGHT - squareSize) / 2, squareSize, squareSize, TFT_BLACK);
    }
    yield();
  }
  
  delay(500);
#endif
}

void tftStepProgressBar() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  
  tft.fillScreen(TFT_BLACK);
  
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(2);
  tft.setCursor(60, 40);
  tft.print("Loading...");
  
  int barX = 30;
  int barY = 100;
  int barWidth = 180;
  int barHeight = 30;
  
  tft.drawRect(barX, barY, barWidth, barHeight, TFT_WHITE);
  
  for (int i = 0; i <= 100; i += 5) {
    int fillWidth = (barWidth - 4) * i / 100;
    tft.fillRect(barX + 2, barY + 2, fillWidth, barHeight - 4, TFT_GREEN);
    
    tft.fillRect(40, 150, 160, 20, TFT_BLACK);
    tft.setTextColor(TFT_CYAN);
    tft.setTextSize(2);
    tft.setCursor(90, 155);
    tft.print(i);
    tft.print("%");
    
    delay(30);
    yield();
  }
  
