morfredus/ESP32-Diagnostic/src/main.cpp
  digitalWrite(rgb_led_pin_b, HIGH);
  delay(150);
  digitalWrite(rgb_led_pin_b, LOW);

  rgbLedTestResult = OK_STR;
  rgbLedAvailable = true;
  Serial.println("LED RGB: OK");
}

void setRGBLedColor(int r, int g, int b) {
  if (rgb_led_pin_r >= 0 && rgb_led_pin_g >= 0 && rgb_led_pin_b >= 0) {
    analogWrite(rgb_led_pin_r, r);
    analogWrite(rgb_led_pin_g, g);
    analogWrite(rgb_led_pin_b, b);
  }
}

// TEST BUZZER
void testBuzzer() {
  Serial.println("\r\n=== TEST BUZZER ===");

  if (buzzer_pin < 0) {
    buzzerTestResult = String(Texts::configuration_invalid);
    buzzerAvailable = false;
    Serial.println("Buzzer: Configuration invalide");
    return;
  }

  pinMode(buzzer_pin, OUTPUT);
  Serial.printf("Test Buzzer - Pin:%d\r\n", buzzer_pin);

  tone(buzzer_pin, 1000, 160);
  delay(220);
  tone(buzzer_pin, 1500, 160);
  delay(220);
  tone(buzzer_pin, 2000, 160);
  delay(220);
  noTone(buzzer_pin);

  buzzerTestResult = OK_STR;
  buzzerAvailable = true;
  Serial.println("Buzzer: OK");
}

void playBuzzerTone(int frequency, int duration) {
  if (BUZZER >= 0) {
    tone(buzzer_pin, frequency, duration);
  }
}

// DHT sensor helpers
static inline const char* getDhtSensorName() {
  return (DHT_SENSOR_TYPE == 22) ? "DHT22" : "DHT11";
}

// TEST DHT SENSOR
void testDHTSensor() {
  const char* sensorName = getDhtSensorName();
  Serial.printf("\r\n=== TEST %s ===\r\n", sensorName);

  if (dht_pin < 0) {
    dhtTestResult = String(Texts::configuration_invalid);
    dhtAvailable = false;
    Serial.printf("%s: Configuration invalide\r\n", sensorName);
    return;
  }

  Serial.printf("Lecture %s - Pin:%d\r\n", sensorName, dht_pin);

  pinMode(dht_pin, OUTPUT);
  digitalWrite(dht_pin, LOW);
  delay(20);
  digitalWrite(dht_pin, HIGH);
  delayMicroseconds(40);
  pinMode(dht_pin, INPUT_PULLUP);

  uint8_t data[5] = {0};
  uint8_t bits[40] = {0};

  unsigned long timeout = millis();
  while (digitalRead(dht_pin) == HIGH) {
    if (millis() - timeout > 100) {
      dhtTestResult = String(Texts::error_label);
      dhtAvailable = false;
      Serial.printf("%s: Timeout\r\n", sensorName);
      return;
    }
  }

  timeout = millis();
  while (digitalRead(dht_pin) == LOW) {
    if (millis() - timeout > 100) {
      dhtTestResult = String(Texts::error_label);
      dhtAvailable = false;
      Serial.printf("%s: Timeout\r\n", sensorName);
      return;
    }
  }

  timeout = millis();
  while (digitalRead(dht_pin) == HIGH) {
    if (millis() - timeout > 100) {
      dhtTestResult = String(Texts::error_label);
      dhtAvailable = false;
      Serial.printf("%s: Timeout\r\n", sensorName);
      return;
    }
  }

  for (int i = 0; i < 40; i++) {
    timeout = micros();
    while (digitalRead(dht_pin) == LOW) {
      if (micros() - timeout > 100) break;
    }

    unsigned long t = micros();
    timeout = micros();
    while (digitalRead(dht_pin) == HIGH) {
      if (micros() - timeout > 100) break;
    }

    if ((micros() - t) > 40) {
      bits[i] = 1;
    }
  }

  for (int i = 0; i < 5; i++) {
    data[i] = 0;
    for (int j = 0; j < 8; j++) {
      data[i] <<= 1;
      data[i] |= bits[i * 8 + j];
    }
  }

  if (data[4] == ((data[0] + data[1] + data[2] + data[3]) & 0xFF)) {
    if (DHT_SENSOR_TYPE == 22) {
      uint16_t rawHumidity = (static_cast<uint16_t>(data[0]) << 8) | data[1];
      uint16_t rawTemperature = (static_cast<uint16_t>(data[2]) << 8) | data[3];
      bool negative = rawTemperature & 0x8000;
      if (negative) {
        rawTemperature &= 0x7FFF;
      }
      dhtHumidity = rawHumidity * 0.1f;
      dhtTemperature = rawTemperature * 0.1f;
      if (negative) {
        dhtTemperature = -dhtTemperature;
      }
    } else {
      dhtHumidity = static_cast<float>(data[0]) + static_cast<float>(data[1]) * 0.1f;
      dhtTemperature = static_cast<float>(data[2]) + static_cast<float>(data[3]) * 0.1f;
    }
    dhtTestResult = OK_STR;
    dhtAvailable = true;
    Serial.printf("%s: T=%.1f°C H=%.1f%%\r\n", sensorName, dhtTemperature, dhtHumidity);
  } else {
    dhtTestResult = String(Texts::error_label);
    dhtAvailable = false;
    Serial.printf("%s: Checksum error\r\n", sensorName);
  }
}

// TEST LIGHT SENSOR
void testLightSensor() {
  Serial.println("\r\n=== TEST LIGHT SENSOR ===");

  if (light_sensor_pin < 0) {
    lightSensorTestResult = String(Texts::configuration_invalid);
    lightSensorAvailable = false;
    Serial.println("Light Sensor: Configuration invalide");
    return;
  }

  pinMode(light_sensor_pin, INPUT);
  Serial.printf("Lecture Light Sensor - Pin:%d\r\n", light_sensor_pin);

  int sum = 0;
  const int samples = 6;
  for (int i = 0; i < samples; i++) {
    sum += analogRead(light_sensor_pin);
    delay(8);
    yield();
  }
  lightSensorValue = sum / samples;

  lightSensorTestResult = OK_STR;
  lightSensorAvailable = true;
  Serial.printf("Light Sensor: %d\r\n", lightSensorValue);
}

// TEST DISTANCE SENSOR
void testDistanceSensor() {
  Serial.println("\r\n=== TEST DISTANCE SENSOR (HC-SR04) ===");

  if (distance_trig_pin < 0 || distance_echo_pin < 0) {
    distanceSensorTestResult = String(Texts::configuration_invalid);
    distanceSensorAvailable = false;
    Serial.println("Distance Sensor: Configuration invalide");
    return;
  }

  // ESP32-S3 (OPI Flash/PSRAM): GPIO 35..48 sont généralement réservées
  // Si utilisées pour TRIG/ECHO, la mesure échouera systématiquement
  if ((distance_trig_pin >= 35 && distance_trig_pin <= 48) ||
      (distance_echo_pin >= 35 && distance_echo_pin <= 48)) {
    distanceSensorTestResult = String(Texts::configuration_invalid);
    distanceSensorAvailable = false;
    Serial.printf("Distance Sensor: Pins invalides sur ESP32-S3 OPI (TRIG=%d, ECHO=%d). Evitez GPIO 35..48.\r\n",
                  distance_trig_pin, distance_echo_pin);
    Serial.println("Suggestion: TRIG=26 (sortie), ECHO=25 (entrée) si le bus I2C secondaire est inactif.");
    return;
  }

  pinMode(distance_trig_pin, OUTPUT);
  pinMode(distance_echo_pin, INPUT);

