morfredus/ESP32-Diagnostic/src/main.cpp
  Serial.printf("Distance Sensor - Trig:%d Echo:%d\r\n", distance_trig_pin, distance_echo_pin);

  // Assurer ECHO à LOW avant de déclencher (éviter faux négatifs)
  {
    unsigned long waitStart = micros();
    while (digitalRead(distance_echo_pin) == HIGH && (micros() - waitStart) < 200000UL) {
      yield();
    }
  }

  // Séquence TRIG: 10 µs HIGH après stabilisation LOW
  digitalWrite(distance_trig_pin, LOW);
  delayMicroseconds(4);
  digitalWrite(distance_trig_pin, HIGH);
  delayMicroseconds(10);
  digitalWrite(distance_trig_pin, LOW);

  // Mesure de l'impulsion ECHO (timeout élargi)
  unsigned long timeoutUs = 60000UL; // 60 ms
  unsigned long duration = 0UL;
#if defined(ARDUINO_ARCH_ESP32)
  duration = pulseInLong(distance_echo_pin, HIGH, timeoutUs);
#else
  duration = pulseIn(distance_echo_pin, HIGH, timeoutUs);
#endif

  if (duration > 0UL) {
    // Vitesse du son ~0.034 cm/µs ; aller-retour => /2
    distanceValue = (double)duration * 0.034 / 2.0;
    distanceSensorTestResult = OK_STR;
    distanceSensorAvailable = true;
    Serial.printf("Distance: %.2f cm\r\n", distanceValue);
  } else {
    distanceSensorTestResult = String(Texts::error_label);
    distanceSensorAvailable = false;
    Serial.println("Distance Sensor: No echo (check wiring/level shifting/target distance)");
  }
}

// TEST MOTION SENSOR
void testMotionSensor() {
  Serial.println("\r\n=== TEST MOTION SENSOR (PIR) ===");

  if (motion_sensor_pin < 0) {
    motionSensorTestResult = String(Texts::configuration_invalid);
    motionSensorAvailable = false;
    Serial.println("Motion Sensor: Configuration invalide");
    return;
  }

  pinMode(motion_sensor_pin, INPUT);
  Serial.printf("Motion Sensor - Pin:%d\r\n", motion_sensor_pin);

  delay(30);
  yield();
  motionDetected = digitalRead(motion_sensor_pin);

  motionSensorTestResult = OK_STR;
  motionSensorAvailable = true;
  Serial.printf("Motion: %s\r\n", motionDetected ? "Detected" : "None");
}

// ========== CARTE SD ==========
bool initSD() {
  Serial.println("\r\n=== INIT SD CARD ===");

  if (sd_miso_pin < 0 || sd_mosi_pin < 0 || sd_sclk_pin < 0 || sd_cs_pin < 0) {
    sdTestResult = String(Texts::configuration_invalid);
    sdAvailable = false;
    Serial.println("SD: Configuration invalide");
    return false;
  }

  // Configuration SPI
  if (sdSPI == nullptr) {
#if defined(CONFIG_IDF_TARGET_ESP32)
    sdSPI = new SPIClass(HSPI);  // ESP32 classic uses HSPI
#else
    sdSPI = new SPIClass(FSPI);  // ESP32-S2/S3 use FSPI (SPI2)
#endif
  }
  sdSPI->begin(sd_sclk_pin, sd_miso_pin, sd_mosi_pin, sd_cs_pin);

  if (!SD.begin(sd_cs_pin, *sdSPI)) {
    sdTestResult = String(Texts::not_detected);
    sdAvailable = false;
    Serial.println("SD: Carte non detectee");
    return false;
  }

  sdAvailable = true;

  // Détection type de carte
  sdCardType = SD.cardType();
  switch (sdCardType) {
    case CARD_MMC:
      sdCardTypeStr = "MMC";
      break;
    case CARD_SD:
      sdCardTypeStr = "SDSC";
      break;
    case CARD_SDHC:
      sdCardTypeStr = "SDHC";
      break;
    default:
      sdCardTypeStr = "UNKNOWN";
  }

  // Taille de la carte
  sdCardSize = SD.cardSize() / (1024 * 1024);  // MB

  Serial.printf("SD: Type=%s, Size=%llu MB\r\n", sdCardTypeStr.c_str(), sdCardSize);

  char sdBuf[128];
  snprintf(sdBuf, sizeof(sdBuf), "OK - %s, %llu MB", sdCardTypeStr.c_str(), sdCardSize);
  sdTestResult = String(sdBuf);

  return true;
}

void testSD() {
  Serial.println("\r\n=== TEST SD CARD ===");

  if (!initSD()) {
    return;
  }

  // Test écriture/lecture
  const char* testFile = "/test_esp32.txt";
  const char* testData = "ESP32 Diagnostic Test";

  // Écriture
  File file = SD.open(testFile, FILE_WRITE);
  if (!file) {
    sdTestResult = "Erreur: Ecriture impossible";
    Serial.println("SD: Erreur ecriture");
    return;
  }

  file.println(testData);
  file.close();
  Serial.println("SD: Ecriture OK");

  // Lecture
  file = SD.open(testFile);
  if (!file) {
    sdTestResult = "Erreur: Lecture impossible";
    Serial.println("SD: Erreur lecture");
    return;
  }

  String readData = file.readStringUntil('\n');
  file.close();

  if (readData == testData) {
    uint64_t totalBytes = SD.totalBytes() / (1024 * 1024);
    uint64_t usedBytes = SD.usedBytes() / (1024 * 1024);

    char sdBuf[200];
    snprintf(sdBuf, sizeof(sdBuf),
             "OK - %s, Total:%llu MB, Utilise:%llu MB, Libre:%llu MB",
             sdCardTypeStr.c_str(), totalBytes, usedBytes, totalBytes - usedBytes);
    sdTestResult = String(sdBuf);
    sdTested = true;
    Serial.println("SD: Test complet OK");
  } else {
    sdTestResult = "Erreur: Verification lecture";
    Serial.println("SD: Erreur verification");
  }

  // Nettoyage
  SD.remove(testFile);
}

String getSDInfo() {
  if (!sdAvailable) {
    return "Non disponible";
  }

  String info = "Type: " + sdCardTypeStr;
  info += ", Taille: " + String((uint32_t)sdCardSize) + " MB";
  info += ", Total: " + String((uint32_t)(SD.totalBytes() / (1024 * 1024))) + " MB";
  info += ", Utilise: " + String((uint32_t)(SD.usedBytes() / (1024 * 1024))) + " MB";

  return info;
}

void resetSDTest() {
  sdTested = false;
  sdAvailable = false;
  SD.end();
}

// ========== ENCODEUR ROTATIF ==========
void initRotaryEncoder() {
  Serial.println("\r\n=== INIT ROTARY ENCODER ===");

  if (rotary_clk_pin < 0 || rotary_dt_pin < 0 || rotary_sw_pin < 0) {
    rotaryTestResult = String(Texts::configuration_invalid);
    rotaryAvailable = false;
    Serial.println("Rotary: Configuration invalide");
    return;
  }

  pinMode(rotary_clk_pin, INPUT_PULLUP);
  pinMode(rotary_dt_pin, INPUT_PULLUP);
  pinMode(rotary_sw_pin, INPUT_PULLUP);

  lastRotaryState = digitalRead(rotary_clk_pin);

  // Attacher interruptions
  attachInterrupt(digitalPinToInterrupt(rotary_clk_pin), rotaryISR, CHANGE);
  attachInterrupt(digitalPinToInterrupt(rotary_dt_pin), rotaryISR, CHANGE);
  attachInterrupt(digitalPinToInterrupt(rotary_sw_pin), rotaryButtonISR, FALLING);

  rotaryAvailable = true;
  rotaryTestResult = "Initialise - Tournez l'encodeur";

  Serial.printf("Rotary: CLK=%d, DT=%d, SW=%d\r\n",
                rotary_clk_pin, rotary_dt_pin, rotary_sw_pin);
}

void testRotaryEncoder() {
  Serial.println("\r\n=== TEST ROTARY ENCODER ===");

  initRotaryEncoder();

