morfredus/ESP32-Diagnostic/src/main.cpp
  if (!rotaryAvailable) {
    return;
  }

  // Reset position
  rotaryPosition = 0;
  rotaryButtonPressed = false;

  Serial.println("Rotary: Tournez l'encodeur et appuyez sur le bouton...");

  unsigned long testStart = millis();
  bool rotationDetected = false;
  bool buttonDetected = false;

  // Test pendant 5 secondes
  while (millis() - testStart < 5000) {
    if (rotaryPosition != 0) {
      rotationDetected = true;
    }

    if (rotaryButtonPressed) {
      buttonDetected = true;
      rotaryButtonPressed = false;  // Reset
    }

    if (rotationDetected && buttonDetected) {
      break;
    }

    delay(10);
    yield();
  }

  char rotaryBuf[256];
  if (rotationDetected && buttonDetected) {
    snprintf(rotaryBuf, sizeof(rotaryBuf),
             "OK - Rotation: %ld, Bouton: detecte", rotaryPosition);
    rotaryTested = true;
  } else if (rotationDetected) {
    snprintf(rotaryBuf, sizeof(rotaryBuf),
             "Partiel - Rotation OK (%ld), Bouton non teste", rotaryPosition);
  } else if (buttonDetected) {
    snprintf(rotaryBuf, sizeof(rotaryBuf),
             "Partiel - Bouton OK, Rotation non testee");
  } else {
    snprintf(rotaryBuf, sizeof(rotaryBuf),
             "Erreur - Aucune activite detectee");
  }

  rotaryTestResult = String(rotaryBuf);
  Serial.println(rotaryTestResult);

  // Reset pour usage normal
  rotaryPosition = 0;
}

void resetRotaryTest() {
  rotaryTested = false;
  rotaryPosition = 0;
  rotaryButtonPressed = false;
  detachInterrupt(digitalPinToInterrupt(rotary_clk_pin));
  detachInterrupt(digitalPinToInterrupt(rotary_dt_pin));
  detachInterrupt(digitalPinToInterrupt(rotary_sw_pin));
  rotaryAvailable = false;
}

long getRotaryPosition() {
  return rotaryPosition;
}

bool getRotaryButtonState() {
  bool state = rotaryButtonPressed;
  rotaryButtonPressed = false;  // Auto-reset après lecture
  return state;
}

void resetRotaryPosition() {
  rotaryPosition = 0;
}

// ========== TEST STRESS MÉMOIRE ==========
void memoryStressTest() {
  Serial.println("\r\n=== STRESS TEST MEMOIRE ===");
  
  unsigned long startMs = millis();
  stressAllocationCount = 0;
  stressDurationMs = 0;

  const int allocSize = 1024;
  int maxAllocs = 0;
  std::vector<void*> allocations;
  
  Serial.println("Allocation progressive...");
  while(true) {
    void* ptr = malloc(allocSize);
    if (!ptr) break;
    allocations.push_back(ptr);
    maxAllocs++;
    
    if (maxAllocs % 100 == 0) {
      Serial.printf("Alloue: %d KB\r\n", maxAllocs);
    }
  }
  
  Serial.printf("Max allocations: %d blocs (%d KB)\r\n", maxAllocs, maxAllocs);


  Serial.println("Liberation memoire...");
  for (auto ptr : allocations) {
    free(ptr);
  }

  stressAllocationCount = maxAllocs;
  stressDurationMs = millis() - startMs;

  stressTestResult = String(Texts::max_alloc) + ": " + String(maxAllocs) + " KB";
  Serial.println("Stress test: OK");
}

// ========== COLLECTE DONNÉES ==========
void collectDiagnosticInfo() {
  esp_chip_info_t chip_info;
  esp_chip_info(&chip_info);
  
  diagnosticData.chipModel = detectChipModel();
  diagnosticData.chipRevision = String(chip_info.revision);
  diagnosticData.cpuCores = chip_info.cores;
  diagnosticData.cpuFreqMHz = ESP.getCpuFreqMHz();
  
  uint32_t flash_size;
  esp_flash_get_size(NULL, &flash_size);
  diagnosticData.flashSize = flash_size;
  diagnosticData.psramSize = ESP.getPsramSize();
  
  uint8_t mac[6];
  esp_read_mac(mac, ESP_MAC_WIFI_STA);
  char macStr[18];
  sprintf(macStr, "%02X:%02X:%02X:%02X:%02X:%02X", 
          mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  diagnosticData.macAddress = String(macStr);
  
  diagnosticData.heapSize = ESP.getHeapSize();
  diagnosticData.freeHeap = ESP.getFreeHeap();
  diagnosticData.minFreeHeap = ESP.getMinFreeHeap();
  diagnosticData.maxAllocHeap = ESP.getMaxAllocHeap();
  
  diagnosticData.hasWiFi = (chip_info.features & CHIP_FEATURE_WIFI_BGN);
  diagnosticData.hasBT = (chip_info.features & CHIP_FEATURE_BT);
  bool featureBLE = (chip_info.features & CHIP_FEATURE_BLE);

#ifdef CHIP_ESP32S2
  if (chip_info.model == CHIP_ESP32S2) {
    runtimeBLE = false;
  }
#endif
#ifdef CHIP_ESP32S3
  if (chip_info.model == CHIP_ESP32S3) {
    runtimeBLE = true;
  }
#endif
#ifdef CHIP_ESP32C3
  if (chip_info.model == CHIP_ESP32C3) {
    runtimeBLE = true;
  }
#endif
#ifdef CHIP_ESP32C6
  if (chip_info.model == CHIP_ESP32C6) {
    runtimeBLE = true;
  }
#endif
#ifdef CHIP_ESP32H2
  if (chip_info.model == CHIP_ESP32H2) {
    runtimeBLE = true;
  }
#endif

  if (WiFi.status() == WL_CONNECTED) {
    diagnosticData.wifiSSID = WiFi.SSID();
    diagnosticData.wifiRSSI = WiFi.RSSI();
    diagnosticData.ipAddress = WiFi.localIP().toString();
#if DIAGNOSTIC_HAS_MDNS
    diagnosticData.mdnsAvailable = mdnsServiceActive;
#else
    diagnosticData.mdnsAvailable = false;
#endif
  } else {
    diagnosticData.wifiSSID = "";
    diagnosticData.wifiRSSI = -127;
    diagnosticData.ipAddress = "";
    diagnosticData.mdnsAvailable = false;
  }
  
  diagnosticData.gpioList = getGPIOList();
  diagnosticData.totalGPIO = countGPIO();
  
  diagnosticData.sdkVersion = ESP.getSdkVersion();
  diagnosticData.idfVersion = esp_get_idf_version();
  diagnosticData.uptime = millis();
  
  #ifdef SOC_TEMP_SENSOR_SUPPORTED
    diagnosticData.temperature = temperatureRead();
  #else
    diagnosticData.temperature = -999;
  #endif
  
  diagnosticData.neopixelTested = neopixelTested;
  diagnosticData.neopixelAvailable = neopixelAvailable;
  diagnosticData.neopixelResult = neopixelTestResult;
  
  diagnosticData.oledTested = oledTested;
  diagnosticData.oledAvailable = oledAvailable;
  diagnosticData.oledResult = oledTestResult;

  heapHistory[historyIndex] = (float)diagnosticData.freeHeap / 1024.0;
  if (diagnosticData.temperature != -999) {
    tempHistory[historyIndex] = diagnosticData.temperature;
  }
  historyIndex = (historyIndex + 1) % HISTORY_SIZE;
}

// Routines de tests en tâche de fond
static void runBuiltinLedTestTask() {
  resetBuiltinLEDTest();
  testBuiltinLED();
}

static void runNeopixelTestTask() {
  neopixelPauseStatus();
  resetNeoPixelTest();
  testNeoPixel();
  neopixelRestoreWifiStatus();
}

