morfredus/ESP32-Diagnostic/src/main.cpp
  neopixelRestoreWifiStatus();
  sendOperationSuccess(message);
}

void handleNeoPixelColor() {
  if (!server.hasArg("r") || !server.hasArg("g") || !server.hasArg("b") || !strip) {
    sendOperationError(400, Texts::configuration_invalid.str());
    return;
  }

  int r = server.arg("r").toInt();
  int g = server.arg("g").toInt();
  int b = server.arg("b").toInt();

  strip->fill(strip->Color(r, g, b));
  strip->show();
  neopixelTested = false;

  String message = "RGB(" + String(r) + "," + String(g) + "," + String(b) + ")";
  sendOperationSuccess(message);
}

void handleOLEDConfig() {
  if (server.hasArg("sda") && server.hasArg("scl") && server.hasArg("rotation")) {
    int newSDA = server.arg("sda").toInt();
    int newSCL = server.arg("scl").toInt();
    int newRotation = server.arg("rotation").toInt();
    
    // Optional resolution parameters
    int newWidth = server.hasArg("width") ? server.arg("width").toInt() : oledWidth;
    int newHeight = server.hasArg("height") ? server.arg("height").toInt() : oledHeight;

    if (newSDA >= 0 && newSDA <= 48 && newSCL >= 0 && newSCL <= 48 && newRotation >= 0 && newRotation <= 3) {
      bool pinsChanged = (i2c_sda != newSDA) || (i2c_scl != newSCL);
      bool rotationChanged = (oledRotation != static_cast<uint8_t>(newRotation));
      bool resolutionChanged = (oledWidth != newWidth) || (oledHeight != newHeight);

      i2c_sda = newSDA;
      i2c_scl = newSCL;
      oledRotation = static_cast<uint8_t>(newRotation);
      oledWidth = newWidth;
      oledHeight = newHeight;

      if (pinsChanged || rotationChanged || resolutionChanged) {
        resetOLEDTest();
        Wire.end();
        detectOLED();
      } else if (oledAvailable) {
        applyOLEDOrientation();
      }

      // [OPT-007]: Buffer-based message formatting to reduce allocations (1 vs 9)
      char messageBuffer[128];
      snprintf(messageBuffer, sizeof(messageBuffer), "I2C reconfigure: SDA:%d SCL:%d Rot:%d Res:%dx%d",
               i2c_sda, i2c_scl, oledRotation, oledWidth, oledHeight);
      sendOperationSuccess(String(messageBuffer), {
        jsonNumberField("sda", i2c_sda),
        jsonNumberField("scl", i2c_scl),
        jsonNumberField("rotation", oledRotation),
        jsonNumberField("width", oledWidth),
        jsonNumberField("height", oledHeight)
      });
      return;
    }
  }
  sendOperationError(400, Texts::configuration_invalid.str());
}

void handleOLEDTest() {
  bool alreadyRunning = false;
  bool started = startAsyncTest(oledTestRunner, runOledTestTask, alreadyRunning, 6144, 1);

  if (started) {
    sendActionResponse(202, true, String(Texts::test_in_progress), {
      jsonBoolField("running", true),
      jsonBoolField("available", oledAvailable),
      jsonStringField("result", oledTestResult)
    });
    return;
  }

  if (alreadyRunning) {
    sendActionResponse(200, true, String(Texts::test_in_progress), {
      jsonBoolField("running", true),
      jsonBoolField("available", oledAvailable),
      jsonStringField("result", oledTestResult)
    });
    return;
  }

  resetOLEDTest();
  testOLED();
  sendActionResponse(200, oledAvailable, oledTestResult, {
    jsonBoolField("running", false),
    jsonBoolField("available", oledAvailable),
    jsonStringField("result", oledTestResult)
  });
}

void handleOLEDStep() {
  if (!server.hasArg("step")) {
    sendOperationError(400, Texts::oled_step_unknown.str());
    return;
  }

  String stepId = server.arg("step");

  if (!oledAvailable) {
    sendActionResponse(200, false, Texts::oled_step_unavailable.str());
    return;
  }

  bool ok = performOLEDStep(stepId);
  if (!ok) {
    sendOperationError(400, Texts::oled_step_unknown.str());
    return;
  }

  String label = getOLEDStepLabel(stepId);
  // [OPT-007]: Buffer-based message formatting (1 vs 2 allocations)
  char msgBuf[256];
  snprintf(msgBuf, sizeof(msgBuf), "%s %s", Texts::oled_step_executed_prefix.str().c_str(), label.c_str());
  sendOperationSuccess(String(msgBuf));
}

void handleOLEDMessage() {
  if (!server.hasArg("message")) {
    sendOperationError(400, Texts::configuration_invalid.str());
    return;
  }

  String message = server.arg("message");
  oledShowMessage(message);
  // Use translation key instead of hardcoded string
  sendOperationSuccess(Texts::message_displayed.str());
}

void handleOLEDBoot() {
  if (!oledAvailable) {
    sendActionResponse(200, false, "OLED not available");
    return;
  }

  oledShowWiFiStatus(PROJECT_NAME, "System Ready", WiFi.localIP().toString(), 100);
  sendOperationSuccess("Boot screen displayed");
}

void handleTFTTest() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) {
    sendActionResponse(200, false, "TFT not available", {
      jsonBoolField("available", false)
    });
    return;
  }

  testTFT();
  sendActionResponse(200, true, "TFT test complete", {
    jsonBoolField("available", true)
  });
#else
  sendActionResponse(200, false, "TFT not enabled", {
    jsonBoolField("available", false)
  });
#endif
}

void handleTFTStep() {
#if ENABLE_TFT_DISPLAY
  if (!server.hasArg("step")) {
    sendOperationError(400, "Step parameter missing");
    return;
  }

  String stepId = server.arg("step");

  if (!tftAvailable) {
    sendActionResponse(200, false, "TFT not available");
    return;
  }

  bool ok = performTFTStep(stepId);
  if (!ok) {
    sendOperationError(400, "Unknown TFT step");
    return;
  }

  String label = getTFTStepLabel(stepId);
  String message = "Step executed: " + label;
  sendOperationSuccess(message);
#else
  sendActionResponse(200, false, "TFT not enabled");
#endif
}

void handleTFTBoot() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) {
    sendActionResponse(200, false, "TFT not available");
    return;
  }

  displayBootSplash();
  
  // Display WiFi info if connected
  if (WiFi.status() == WL_CONNECTED) {
    displayWiFiConnected(WiFi.SSID().c_str(), WiFi.localIP().toString().c_str());
  } else {
    displayWiFiStatus("WiFi not connected", TFT_ORANGE);
  }
  
  sendOperationSuccess("Boot screen displayed");
#else
  sendActionResponse(200, false, "TFT not enabled");
#endif
}

void handleTFTConfig() {
#if ENABLE_TFT_DISPLAY
  // Check for required parameters
  if (server.hasArg("mosi") && server.hasArg("sclk") && server.hasArg("cs") &&
      server.hasArg("dc") && server.hasArg("rst")) {

    int newMISO = server.hasArg("miso") ? server.arg("miso").toInt() : tftMISO;
    int newMOSI = server.arg("mosi").toInt();
    int newSCLK = server.arg("sclk").toInt();
    int newCS = server.arg("cs").toInt();
    int newDC = server.arg("dc").toInt();
    int newRST = server.arg("rst").toInt();

    // Optional parameters
    int newBL = server.hasArg("bl") ? server.arg("bl").toInt() : tftBL;
    int newWidth = server.hasArg("width") ? server.arg("width").toInt() : tftWidth;
    int newHeight = server.hasArg("height") ? server.arg("height").toInt() : tftHeight;
    int newRotation = server.hasArg("rotation") ? server.arg("rotation").toInt() : tftRotation;

    // Validate pin ranges
    if (newMISO >= -1 && newMISO <= 48 && newMOSI >= 0 && newMOSI <= 48 &&
        newSCLK >= 0 && newSCLK <= 48 && newCS >= 0 && newCS <= 48 &&
        newDC >= 0 && newDC <= 48 && newRST >= -1 && newRST <= 48 &&
        newBL >= -1 && newBL <= 48 && newRotation >= 0 && newRotation <= 3) {

      // Update configuration
      tftMISO = newMISO;
      tftMOSI = newMOSI;
      tftSCLK = newSCLK;
      tftCS = newCS;
      tftDC = newDC;
      tftRST = newRST;
      tftBL = newBL;
      tftWidth = newWidth;
      tftHeight = newHeight;
      tftRotation = newRotation;

      // Reinitialize TFT with new settings
      tftAvailable = false;
      // Note: Complete reinitialization would require SPI reconfiguration
      // For now, we just store the values for next reboot

      String message = "TFT config updated: MISO:" + String(tftMISO) + " MOSI:" + String(tftMOSI) +
                       " SCLK:" + String(tftSCLK) + " CS:" + String(tftCS) + " DC:" + String(tftDC) +
                       " RST:" + String(tftRST) + " Res:" + String(tftWidth) + "x" + String(tftHeight) +
                       " Rot:" + String(tftRotation);

      sendOperationSuccess(message, {
        jsonNumberField("miso", tftMISO),
        jsonNumberField("mosi", tftMOSI),
        jsonNumberField("sclk", tftSCLK),
        jsonNumberField("cs", tftCS),
        jsonNumberField("dc", tftDC),
        jsonNumberField("rst", tftRST),
        jsonNumberField("bl", tftBL),
        jsonNumberField("width", tftWidth),
        jsonNumberField("height", tftHeight),
        jsonNumberField("rotation", tftRotation)
      });
      return;
    }
  }
  sendOperationError(400, Texts::configuration_invalid.str());
#else
  sendActionResponse(200, false, "TFT not enabled");
#endif
}

void handleADCTest() {
  testADC();
  String json;
  json.reserve(adcReadings.size() * 60 + 50);  // Estimate size to avoid reallocations
  json = "{\"readings\":[";
  for (size_t i = 0; i < adcReadings.size(); i++) {
    if (i > 0) json += ",";
    json += "{\"pin\":" + String(adcReadings[i].pin) + ",\"raw\":" + String(adcReadings[i].rawValue) +
            ",\"voltage\":" + String(adcReadings[i].voltage, 2) + "}";
  }
  json += "],\"result\":\"" + adcTestResult + "\"}";
  server.send(200, "application/json", json);
}

void handlePWMTest() {
  testPWM();
  sendJsonResponse(200, { jsonStringField("result", pwmTestResult) });
}

void handleSPIScan() {
  scanSPI();
  sendJsonResponse(200, { jsonStringField("info", spiInfo) });
}

void handlePartitionsList() {
  listPartitions();
  sendJsonResponse(200, { jsonStringField("partitions", partitionsInfo) });
}

void handleStressTest() {
  memoryStressTest();
  sendJsonResponse(200, {
    jsonStringField("result", stressTestResult),
    jsonNumberField("allocations", static_cast<unsigned long>(stressAllocationCount)),
    jsonNumberField("durationMs", stressDurationMs),
    jsonStringField("allocationsLabel", stressTestResult)
  });
}

