morfredus/ESP32-Diagnostic/src/main.cpp
    resetSDTest();
    sendActionResponse(200, true, OK_STR);
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleSDTest() {
  bool alreadyRunning = false;
  bool started = startAsyncTest(sdTestRunner, runSDTestTask, alreadyRunning, 6144, 1);

  if (started) {
    sendJsonResponse(202, {
      jsonBoolField("running", true),
      jsonBoolField("success", sdAvailable),
      jsonStringField("result", sdTestResult)
    });
    return;
  }

  if (alreadyRunning) {
    sendJsonResponse(200, {
      jsonBoolField("running", true),
      jsonBoolField("success", sdAvailable),
      jsonStringField("result", sdTestResult)
    });
    return;
  }

  testSD();
  sendJsonResponse(200, {
    jsonBoolField("running", false),
    jsonBoolField("success", sdAvailable),
    jsonStringField("result", sdTestResult)
  });
}

void handleSDInfo() {
  if (!sdAvailable) {
    initSD();
  }

  sendJsonResponse(200, {
    jsonBoolField("available", sdAvailable),
    jsonStringField("type", sdCardTypeStr),
    jsonNumberField("size_mb", (uint32_t)sdCardSize),
    jsonNumberField("total_mb", sdAvailable ? (uint32_t)(SD.totalBytes() / (1024 * 1024)) : 0),
    jsonNumberField("used_mb", sdAvailable ? (uint32_t)(SD.usedBytes() / (1024 * 1024)) : 0),
    jsonStringField("result", sdTestResult)
  });
}

void handleSDTestRead() {
  if (!sdAvailable) {
    initSD();
  }

  if (!sdAvailable) {
    sendJsonResponse(200, {
      jsonBoolField("success", false),
      jsonStringField("result", String(Texts::not_available))
    });
    return;
  }

  // Test lecture
  const char* testFile = "/test_read.txt";

  // Créer un fichier de test si nécessaire
  if (!SD.exists(testFile)) {
    File file = SD.open(testFile, FILE_WRITE);
    if (file) {
      file.println("ESP32 Read Test Data");
      file.close();
    }
  }

  // Lecture
  File file = SD.open(testFile);
  if (!file) {
    sendJsonResponse(200, {
      jsonBoolField("success", false),
      jsonStringField("result", "Read test failed: Cannot open file")
    });
    return;
  }

  String readData = file.readStringUntil('\n');
  file.close();

  sendJsonResponse(200, {
    jsonBoolField("success", true),
    jsonStringField("result", "Read test OK - " + String(readData.length()) + " bytes read")
  });
}

void handleSDTestWrite() {
  if (!sdAvailable) {
    initSD();
  }

  if (!sdAvailable) {
    sendJsonResponse(200, {
      jsonBoolField("success", false),
      jsonStringField("result", String(Texts::not_available))
    });
    return;
  }

  // Test écriture
  const char* testFile = "/test_write.txt";
  const char* testData = "ESP32 Write Test - ";

  File file = SD.open(testFile, FILE_WRITE);
  if (!file) {
    sendJsonResponse(200, {
      jsonBoolField("success", false),
      jsonStringField("result", "Write test failed: Cannot create file")
    });
    return;
  }

  file.print(testData);
  file.println(millis());
  file.close();

  sendJsonResponse(200, {
    jsonBoolField("success", true),
    jsonStringField("result", "Write test OK - File created successfully")
  });
}

void handleSDFormat() {
  if (!sdAvailable) {
    initSD();
  }

  if (!sdAvailable) {
    sendJsonResponse(200, {
      jsonBoolField("success", false),
      jsonStringField("result", String(Texts::not_available))
    });
    return;
  }

  // Nettoyer tous les fichiers de test
  SD.remove("/test_esp32.txt");
  SD.remove("/test_read.txt");
  SD.remove("/test_write.txt");

  // Note: Full SD card formatting requires low-level access
  // This is a basic cleanup of test files
  // For full format, would need SD_MMC.format() or similar

  sendJsonResponse(200, {
    jsonBoolField("success", true),
    jsonStringField("result", "Test files cleaned - SD card ready")
  });
}

// ========== ROTARY ENCODER HANDLERS ==========
void handleRotaryConfig() {
  if (server.hasArg("clk") && server.hasArg("dt") && server.hasArg("sw")) {
    rotary_clk_pin = server.arg("clk").toInt();
    rotary_dt_pin = server.arg("dt").toInt();
    rotary_sw_pin = server.arg("sw").toInt();

    resetRotaryTest();
    sendActionResponse(200, true, OK_STR);
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleRotaryTest() {
  bool alreadyRunning = false;
  bool started = startAsyncTest(rotaryTestRunner, runRotaryTestTask, alreadyRunning, 4096, 1);

  if (started) {
    sendJsonResponse(202, {
      jsonBoolField("running", true),
      jsonBoolField("success", rotaryAvailable),
      jsonStringField("result", rotaryTestResult)
    });
    return;
  }

  if (alreadyRunning) {
    sendJsonResponse(200, {
      jsonBoolField("running", true),
      jsonBoolField("success", rotaryAvailable),
      jsonStringField("result", rotaryTestResult)
    });
    return;
  }

  testRotaryEncoder();
  sendJsonResponse(200, {
    jsonBoolField("running", false),
    jsonBoolField("success", rotaryAvailable),
    jsonStringField("result", rotaryTestResult)
  });
}

void handleRotaryPosition() {
  sendJsonResponse(200, {
    jsonNumberField("position", (int32_t)rotaryPosition),
    jsonBoolField("button_pressed", rotaryButtonPressed),
    jsonBoolField("available", rotaryAvailable)
  });
}

void handleRotaryReset() {
  resetRotaryPosition();
  sendActionResponse(200, true, "Position reset");
}

// GPS Handlers
void handleGPSData() {
  updateGPS();
  String json;
  json.reserve(400);
  json = "{";
  json += "\"valid\":" + String(gpsData.valid ? "true" : "false") + ",";
  json += "\"hasFix\":" + String(gpsData.hasFix ? "true" : "false") + ",";
  json += "\"latitude\":" + String(gpsData.latitude, 6) + ",";
  json += "\"longitude\":" + String(gpsData.longitude, 6) + ",";
  json += "\"altitude\":" + String(gpsData.altitude, 2) + ",";
  json += "\"satellites\":" + String(gpsData.satellites) + ",";
  json += "\"satellites_used\":" + String(gpsData.satellites_used) + ",";
  json += "\"hdop\":" + String(gpsData.hdop, 2) + ",";
  json += "\"speed\":" + String(gpsData.speed, 2) + ",";
  json += "\"course\":" + String(gpsData.course, 2) + ",";
  json += "\"fix_type\":\"" + gpsData.fix_type + "\",";
  json += "\"status\":\"" + gpsData.status_str + "\",";
  json += "\"time\":\"" + String(gpsData.hour) + ":" + String(gpsData.minute) + ":" + String(gpsData.second) + "\",";
  json += "\"date\":\"" + String(gpsData.day) + "/" + String(gpsData.month) + "/" + String(gpsData.year) + "\"";
  json += "}";
  
  server.send(200, "application/json", json);
}

void handleGPSTest() {
  testGPS();
  String json;
  json.reserve(200);
  json = "{";
  json += "\"success\":" + String(gpsAvailable ? "true" : "false") + ",";
  json += "\"result\":\"" + gpsTestResult + "\",";
  json += "\"available\":" + String(gpsAvailable ? "true" : "false");
  json += "}";
  
  server.send(200, "application/json", json);
}

// Environmental Sensors Handlers
void handleEnvironmentalSensors() {
  updateEnvironmentalSensors();
  String json;
  json.reserve(400);
  json = "{";
  json += "\"aht20_available\":" + String(envData.aht20_available ? "true" : "false") + ",";
  json += "\"bmp280_available\":" + String(envData.bmp280_available ? "true" : "false") + ",";
  json += "\"temperature_avg\":" + String(envData.temperature_avg, 1) + ",";
  json += "\"humidity\":" + String(envData.humidity, 1) + ",";
  json += "\"pressure\":" + String(envData.pressure, 2) + ",";
  json += "\"altitude\":" + String(envData.altitude, 1) + ",";
  json += "\"aht20_temp\":" + String(envData.temperature_aht20, 1) + ",";
  json += "\"bmp280_temp\":" + String(envData.temperature_bmp280, 1) + ",";
  json += "\"aht20_status\":\"" + envData.aht20_status + "\",";
  json += "\"bmp280_status\":\"" + envData.bmp280_status + "\",";
  json += "\"combined_status\":\"" + envData.combined_status + "\"";
  json += "}";
  
  server.send(200, "application/json", json);
}

