morfredus/ESP32-Diagnostic/src/main.cpp
// Language-aware translation extraction endpoint
void handleGetTranslations() {
  Language target = currentLanguage;
  if (server.hasArg("lang")) {
    String requested = server.arg("lang");
    requested.toLowerCase();
    if (requested == "fr") {
      target = LANG_FR;
    } else if (requested == "en") {
      target = LANG_EN;
    } else {
      sendJsonResponse(400, {
        jsonBoolField("success", false),
        jsonStringField("error", String(Texts::language_switch_error))
      });
      return;
    }
  }

  server.send(200, "application/json; charset=utf-8", buildTranslationsJSON(target));
}

// Log client connection with IP address
void logClientConnection(const char* endpoint) {
  if (server.client()) {
    IPAddress clientIP = server.client().remoteIP();
    Serial.printf("[Client] %s connected from IP: %s\r\n", endpoint, clientIP.toString().c_str());
  }
}

// ========== INTERFACE WEB PRINCIPALE MULTILINGUE ==========
// Unique JavaScript handler defined in sketch (handleJavaScriptRoute)
void handleJavaScriptRoute() {
  logClientConnection("JS Resource");
  unsigned long startTime = millis();

  // Use chunked transfer to avoid memory issues
  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "application/javascript; charset=utf-8", "");

  // ===== LOGS DE DÉBOGAGE =====
  Serial.println("\n========== JAVASCRIPT DEBUG (CHUNKED) ==========");
  Serial.printf("Free heap at start: %d bytes\n", ESP.getFreeHeap());

  // Send preamble
  String preamble = "console.log('";
  preamble += String(PROJECT_NAME) + " v";
  preamble += DIAGNOSTIC_VERSION_STR;
  preamble += " - Initialisation');const UPDATE_INTERVAL=5000;let currentLang='";
  preamble += (currentLanguage == LANG_FR) ? "fr" : "en";
  preamble += "';let updateTimer=null;let isConnected=true;";

  Serial.printf("Sending preamble: %d bytes\n", preamble.length());
  server.sendContent(preamble);

  // Send pin constants from board_config.h (BEFORE translations and static code)
  String pinVars = "const RGB_LED_PIN_R=";
  pinVars += String(rgb_led_pin_r);
  pinVars += ";const RGB_LED_PIN_G=";
  pinVars += String(rgb_led_pin_g);
  pinVars += ";const RGB_LED_PIN_B=";
  pinVars += String(rgb_led_pin_b);
  pinVars += ";const DHT_PIN=";
  pinVars += String(dht_pin);
  pinVars += ";const LIGHT_SENSOR_PIN=";
  pinVars += String(light_sensor_pin);
  pinVars += ";const DISTANCE_TRIG_PIN=";
  pinVars += String(distance_trig_pin);
  pinVars += ";const DISTANCE_ECHO_PIN=";
  pinVars += String(distance_echo_pin);
  pinVars += ";const MOTION_SENSOR_PIN=";
  pinVars += String(motion_sensor_pin);
  pinVars += ";const PWM_PIN=";
  pinVars += String(pwm_pin);
  pinVars += ";const BUZZER_PIN=";
  pinVars += String(buzzer_pin);
  pinVars += ";const SD_MISO_PIN=";
  pinVars += String(sd_miso_pin);
  pinVars += ";const SD_MOSI_PIN=";
  pinVars += String(sd_mosi_pin);
  pinVars += ";const SD_SCLK_PIN=";
  pinVars += String(sd_sclk_pin);
  pinVars += ";const SD_CS_PIN=";
  pinVars += String(sd_cs_pin);
  pinVars += ";const ROTARY_CLK_PIN=";
  pinVars += String(rotary_clk_pin);
  pinVars += ";const ROTARY_DT_PIN=";
  pinVars += String(rotary_dt_pin);
  pinVars += ";const ROTARY_SW_PIN=";
  pinVars += String(rotary_sw_pin);
  pinVars += ";console.log('GPIO Pins from board_config:',{SD_MISO:SD_MISO_PIN,SD_MOSI:SD_MOSI_PIN,SD_SCLK:SD_SCLK_PIN,SD_CS:SD_CS_PIN,ROTARY_CLK:ROTARY_CLK_PIN,ROTARY_DT:ROTARY_DT_PIN,ROTARY_SW:ROTARY_SW_PIN});";

  Serial.printf("Sending pin variables: %d bytes\n", pinVars.length());
  Serial.printf("  RGB_R=%d, RGB_G=%d, RGB_B=%d\n", rgb_led_pin_r, rgb_led_pin_g, rgb_led_pin_b);
  Serial.printf("  DHT=%d, LIGHT=%d, MOTION=%d, PWM=%d\n", dht_pin, light_sensor_pin, motion_sensor_pin, buzzer_pin);
  Serial.printf("  DIST_TRIG=%d, DIST_ECHO=%d\n", distance_trig_pin, distance_echo_pin);
  Serial.printf("  SD_MISO=%d, SD_MOSI=%d, SD_SCLK=%d, SD_CS=%d\n", sd_miso_pin, sd_mosi_pin, sd_sclk_pin, sd_cs_pin);
  Serial.printf("  ROTARY_CLK=%d, ROTARY_DT=%d, ROTARY_SW=%d\n", rotary_clk_pin, rotary_dt_pin, rotary_sw_pin);
  server.sendContent(pinVars);

  // Send translations
  String translations = "const DEFAULT_TRANSLATIONS=";
  translations += buildTranslationsJSON();
  translations += ";let translationsCache=DEFAULT_TRANSLATIONS;";

  Serial.printf("Sending translations: %d bytes\n", translations.length());
  server.sendContent(translations);

  // Send main JavaScript from PROGMEM without allocating a giant String
  // Stream in chunks to avoid heap exhaustion on ESP32 classic
  const char* staticJsPtr = DIAGNOSTIC_JS_STATIC;
  size_t staticJsLen = strlen_P(staticJsPtr);

  Serial.printf("Sending static JS (chunked): %d bytes\n", staticJsLen);
  const size_t CHUNK_SIZE = 1024;
  char chunkBuf[CHUNK_SIZE + 1];
  size_t sent = 0;
  while (sent < staticJsLen) {
    size_t n = (staticJsLen - sent) > CHUNK_SIZE ? CHUNK_SIZE : (staticJsLen - sent);
    memcpy_P(chunkBuf, staticJsPtr + sent, n);
    chunkBuf[n] = '\0';
    server.sendContent(chunkBuf);
    sent += n;
  }

  // Verify critical functions are present (direct pointer access works on ESP32)
  bool hasShowTab = (strstr(staticJsPtr, "function showTab") != NULL);
  bool hasChangeLang = (strstr(staticJsPtr, "function changeLang") != NULL);

  Serial.printf("Function showTab: %s\n", hasShowTab ? "YES" : "NO [ERROR]");
  Serial.printf("Function changeLang: %s\n", hasChangeLang ? "YES" : "NO [ERROR]");

  if (!hasShowTab || !hasChangeLang) {
    Serial.println("CRITICAL ERROR: JS functions missing in PROGMEM!");
    Serial.println("Check DIAGNOSTIC_JS_STATIC in web_interface.h");
  }

  // End chunked transfer
  server.sendContent("");

  unsigned long generateTime = millis() - startTime;
  Serial.printf("Total generation time: %lu ms\n", generateTime);
  Serial.printf("Free heap at end: %d bytes\n", ESP.getFreeHeap());
  Serial.println("======================================\n");
}

// Modern web interface with dynamic tabs
void handleRoot() {
  logClientConnection("Web Interface");
  server.send(200, "text/html; charset=utf-8", generateHTML());
}

// ========== DEBUG ROUTES (Troubleshooting) ==========
void setupDebugRoutes() {
  // Minimal test JavaScript
  server.on("/js/test.js", []() {
    String js = "console.log('Test JS loaded successfully');\n";
    js += "function showTab(n,b){console.log('showTab called:',n);alert('Test showTab: '+n);}\n";
    js += "function changeLang(l,b){console.log('changeLang called:',l);alert('Test changeLang: '+l);}\n";
    js += "console.log('Test functions defined');\n";
    server.send(200, "application/javascript; charset=utf-8", js);
  });

  // Debug status endpoint
  server.on("/debug/status", []() {
    String json = "{";
    json += "\"freeHeap\":" + String(ESP.getFreeHeap()) + ",";
    json += "\"jsSize\":" + String(generateJavaScript().length()) + ",";
    json += "\"version\":\"" + String(DIAGNOSTIC_VERSION_STR) + "\"";
    json += "}";
    server.send(200, "application/json", json);
  });

  Serial.println("[DEBUG] Debug routes installed: /js/test.js, /debug/status");
}

// ========== SETUP COMPLET ==========
void setup() {
  Serial.begin(115200);
  delay(1000);

