morfredus/ESP32-Diagnostic/src/main.cpp
  Serial.println("\r\n===============================================");
  Serial.println("     DIAGNOSTIC ESP32 MULTILINGUE");
  Serial.printf("     Version %s - FR/EN\r\n", DIAGNOSTIC_VERSION_STR);
  Serial.printf("     Arduino Core %s\r\n", getArduinoCoreVersionString().c_str());
#if defined(TARGET_ESP32_S3)
  Serial.println("     TARGET: ESP32-S3 (N16R8/N8R8)");
#elif defined(TARGET_ESP32_CLASSIC)
  Serial.println("     TARGET: ESP32 CLASSIC (DevKitC)");
#else
  Serial.println("     TARGET: UNKNOWN - CHECK platformio.ini!");
#endif
  Serial.printf("     RGB LED Pins: R=%d G=%d B=%d\r\n", rgb_led_pin_r, rgb_led_pin_g, rgb_led_pin_b);
  Serial.println("===============================================\r\n");

  printPSRAMDiagnostic();

  // Early OLED detection for WiFi status feedback
  detectOLED();

  // TFT Display initialization
  if (initTFT()) {
    displayBootSplash();
    delay(1000);
  }

  // NeoPixel (WiFi feedback heartbeat)
  detectNeoPixelSupport();
  if (strip != nullptr) {
    strip->begin();
    strip->setBrightness(60);
    strip->clear();
    strip->show();
  }

  // WiFi
  WiFi.mode(WIFI_STA);
  WiFi.persistent(false);

  WiFi.setSleep(false);
  configureNetworkHostname();
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 3, 0)
  WiFi.setScanMethod(WIFI_ALL_CHANNEL_SCAN);
#ifdef WIFI_CONNECT_AP_BY_SIGNAL
  WiFi.setSortMethod(WIFI_CONNECT_AP_BY_SIGNAL);
#endif
#endif
  wifiMulti.addAP(WIFI_SSID_1, WIFI_PASS_1);
  wifiMulti.addAP(WIFI_SSID_2, WIFI_PASS_2);

  Serial.println("Connexion WiFi...");
  const int maxWiFiAttempts = 40;
  int attempt = 0;
  neopixelShowConnecting();
  if (oledAvailable) {
    oledShowWiFiStatus(String(Texts::wifi_connection),
                       String(Texts::loading),
                       "",
                       0);
  }
  displayWiFiStatus("Connecting to WiFi...");
  while (wifiMulti.run() != WL_CONNECTED && attempt < maxWiFiAttempts) {
    delay(500);
    Serial.print(".");
    attempt++;
    if (oledAvailable) {
      int progress = (attempt * 100) / maxWiFiAttempts;
      if (progress > 100) {
        progress = 100;
      }
      // [OPT-007]: Buffer-based progress text (1 vs 3 allocations)
      char detailBuf[64];
      snprintf(detailBuf, sizeof(detailBuf), "%s %d%%", Texts::loading.str().c_str(), progress);
      oledShowWiFiStatus(String(Texts::wifi_connection),
                         String(detailBuf),
                         "",
                         progress);
    }
  }

  bool wifiConnected = (WiFi.status() == WL_CONNECTED);
#if DIAGNOSTIC_HAS_MDNS
  wifiPreviouslyConnected = wifiConnected;
#endif

  if (wifiConnected) {
    Serial.println("\r\n\r\nWiFi OK!");
    Serial.printf("SSID: %s\r\n", WiFi.SSID().c_str());
    Serial.printf("IP: %s\r\n\r\n", WiFi.localIP().toString().c_str());
    if (oledAvailable) {
      // [OPT-007]: Buffer-based WiFi status detail (1 vs 2 allocations)
      char detailBuf[96];
      snprintf(detailBuf, sizeof(detailBuf), "%s: %s", Texts::connected.str().c_str(), WiFi.SSID().c_str());
      String footer = WiFi.localIP().toString();
      oledShowWiFiStatus(String(Texts::wifi_connection), String(detailBuf), footer, 100);
    }
    displayWiFiConnected(WiFi.SSID().c_str(), WiFi.localIP().toString().c_str());
    neopixelSetWifiState(true);
    if (startMDNSService(true)) {
      Serial.printf("[Accès] Lien constant : %s\r\n", getStableAccessURL().c_str());
    } else {
      Serial.println("[mDNS] Initialisation différée - nouvel essai automatique");
    }
  } else {
    Serial.println("\r\n\r\nPas de WiFi\r\n");
    Serial.printf("[Accès] Lien constant disponible après connexion : %s\r\n", getStableAccessURL().c_str());
    if (oledAvailable) {
      oledShowWiFiStatus(String(Texts::wifi_connection),
                         String(Texts::disconnected),
                         getStableAccessURL(),
                         -1);
    }
    displayWiFiFailed();
    neopixelSetWifiState(false);
  }

  // Détections
  detectBuiltinLED();
  
  if (ENABLE_I2C_SCAN) {
    scanI2C();
  }
  
  scanSPI();
  listPartitions();
  
  collectDiagnosticInfo();
  collectDetailedMemory();

  // Initialize GPS module
  initGPS();
  
  // Initialize environmental sensors (AHT20 + BMP280)
  initEnvironmentalSensors();

  // ========== ROUTES SERVEUR ==========
  server.on("/", handleRoot);
  server.on("/js/app.js", handleJavaScriptRoute);

  // **TRANSLATION API**
  server.on("/api/get-translations", handleGetTranslations);
  server.on("/api/set-language", handleSetLanguage);

  // Data endpoints
  server.on("/api/status", handleStatus);
  server.on("/api/overview", handleOverview);
  server.on("/api/system-info", handleSystemInfo);
  server.on("/api/memory", handleMemory);
  server.on("/api/wifi-info", handleWiFiInfo);
  server.on("/api/peripherals", handlePeripherals);
  server.on("/api/leds-info", handleLedsInfo);
  server.on("/api/screens-info", handleScreensInfo);

  // GPIO & WiFi
  server.on("/api/test-gpio", handleTestGPIO);
  server.on("/api/wifi-scan", handleWiFiScan);
  server.on("/api/i2c-scan", handleI2CScan);

  // LED intégrée
  server.on("/api/builtin-led-config", handleBuiltinLEDConfig);
  server.on("/api/builtin-led-test", handleBuiltinLEDTest);
  server.on("/api/builtin-led-control", handleBuiltinLEDControl);
  
  // NeoPixel
  server.on("/api/neopixel-config", handleNeoPixelConfig);
  server.on("/api/neopixel-test", handleNeoPixelTest);
  server.on("/api/neopixel-pattern", handleNeoPixelPattern);
  server.on("/api/neopixel-color", handleNeoPixelColor);
  
  // Écrans
  server.on("/api/oled-test", handleOLEDTest);
  server.on("/api/oled-step", handleOLEDStep);
  server.on("/api/oled-message", handleOLEDMessage);
  server.on("/api/oled-config", handleOLEDConfig);
  server.on("/api/oled-boot", handleOLEDBoot);
  
  // TFT display routes
  server.on("/api/tft-test", handleTFTTest);
  server.on("/api/tft-step", handleTFTStep);
  server.on("/api/tft-boot", handleTFTBoot);
  server.on("/api/tft-config", handleTFTConfig);
  
