morfredus/ESP32-Diagnostic/src/main.cpp
  // Tests avancés
  server.on("/api/adc-test", handleADCTest);
  server.on("/api/pwm-test", handlePWMTest);
  server.on("/api/spi-scan", handleSPIScan);
  server.on("/api/partitions-list", handlePartitionsList);
  server.on("/api/stress-test", handleStressTest);

  // Routes API pour les nouveaux capteurs
  server.on("/api/rgb-led-config", handleRGBLedConfig);
  server.on("/api/rgb-led-test", handleRGBLedTest);
  server.on("/api/rgb-led-color", handleRGBLedColor);

  server.on("/api/buzzer-config", handleBuzzerConfig);
  server.on("/api/buzzer-test", handleBuzzerTest);
  server.on("/api/buzzer-tone", handleBuzzerTone);

  server.on("/api/dht-config", handleDHTConfig);
  server.on("/api/dht-test", handleDHTTest);

  server.on("/api/light-sensor-config", handleLightSensorConfig);
  server.on("/api/light-sensor-test", handleLightSensorTest);

  server.on("/api/distance-sensor-config", handleDistanceSensorConfig);
  server.on("/api/distance-sensor-test", handleDistanceSensorTest);

  server.on("/api/motion-sensor-config", handleMotionSensorConfig);
  server.on("/api/motion-sensor-test", handleMotionSensorTest);

  // SD Card
  server.on("/api/sd-config", handleSDConfig);
  server.on("/api/sd-test", handleSDTest);
  server.on("/api/sd-info", handleSDInfo);
  server.on("/api/sd-test-read", handleSDTestRead);
  server.on("/api/sd-test-write", handleSDTestWrite);
  server.on("/api/sd-format", handleSDFormat);

  // Rotary Encoder
  server.on("/api/rotary-config", handleRotaryConfig);
  server.on("/api/rotary-test", handleRotaryTest);
  server.on("/api/rotary-position", handleRotaryPosition);
  server.on("/api/rotary-reset", handleRotaryReset);

  // GPS Module
  server.on("/api/gps", handleGPSData);
  server.on("/api/gps-test", handleGPSTest);

  // Environmental Sensors (AHT20 + BMP280)
  server.on("/api/environmental-sensors", handleEnvironmentalSensors);
  server.on("/api/environmental-test", handleEnvironmentalTest);

  // Performance & Mémoire
  server.on("/api/benchmark", handleBenchmark);
  server.on("/api/memory-details", handleMemoryDetails);
  
  // Exports
  server.on("/export/txt", handleExportTXT);
  server.on("/export/json", handleExportJSON);
  server.on("/export/csv", handleExportCSV);
  server.on("/print", handlePrintVersion);

  server.begin();

  // Install debug routes for troubleshooting
  setupDebugRoutes();

  Serial.println("Serveur Web OK!");
  Serial.println("\r\n===============================================");
  Serial.println("            PRET - En attente");
  Serial.println("   Langue par défaut: FRANCAIS");
  Serial.println("   Changement dynamique via interface web");
  Serial.println("===============================================\r\n");

#if ENABLE_BUTTONS
  initButtons();
  Serial.printf("Boutons actifs: BTN1=%d, BTN2=%d\r\n", button1Pin, button2Pin);
#endif
}

// ========== LOOP ==========
void loop() {
  server.handleClient();
  maintainNetworkServices();
  updateNeoPixelWifiStatus();

#if ENABLE_BUTTONS
  maintainButtons();
#endif

  static unsigned long lastUpdate = 0;
  if (millis() - lastUpdate > 30000) {
    lastUpdate = millis();
    collectDiagnosticInfo();
    
    Serial.println("\r\n=== UPDATE ===");
    Serial.printf("Heap: %.2f KB | Uptime: %.2f h\r\n", 
                  diagnosticData.freeHeap / 1024.0, 
                  diagnosticData.uptime / 3600000.0);
    if (diagnosticData.temperature != -999) {
      Serial.printf("Temp: %.1f°C\r\n", diagnosticData.temperature);
    }
  }

  delay(10);
}
